Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalLinkNotConnected Property
 Analytical Link has lost one or more references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AnalyticalLinkNotConnected { get; }
Public Shared ReadOnly Property AnalyticalLinkNotConnected As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AnalyticalLinkNotConnected {
	FailureDefinitionId^ get ();
}
static member AnalyticalLinkNotConnected : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace